app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "testing "], ["body", "working out ways to check for the news posts "], ["created_at", "2021-03-31 20:50:21.044103"], ["updated_at", "2021-03-31 20:50:21.044103"], ["status", "public"]]